---
kind: property
id: P:Autodesk.Revit.DB.DisplacementPath.AncestorIdx
source: html/fed5f5e3-2f84-1ccf-458d-d2c3f30d3a02.htm
---
# Autodesk.Revit.DB.DisplacementPath.AncestorIdx Property

Specifies the end point of the path.

## Syntax (C#)
```csharp
public int AncestorIdx { get; set; }
```